app/views/ranktables/show.html.erb

  <%= form_tag votes_path do %>
    <% @ranktable.options.split(/,/).each do |text| %>
---
SELECT "options".* FROM "options" WHERE "options"."ranktable_id" = ?  [["ranktable_id", 20]]