app/views/results/index.html.erb

<h1>Results for <%= @ranktable.title %></h1>
<%@ranktable.option.each do |option| %>
---
SELECT "options".* FROM "options" WHERE "options"."ranktable_id" = ?  [["ranktable_id", 22]]