app/controllers/me_controller.rb

  def show
    @ranktables = Ranktable.where(authorID: current_user.id)
    @tableIDs = Vote.where(userID: current_user.id).select(:tableID)
    @votetables = Ranktable.where(id: @tableIDs)
---
SELECT "ranktables".* FROM "ranktables" WHERE "ranktables"."authorID" = ?  [["authorID", 1]]
SELECT "ranktables".* FROM "ranktables" WHERE "ranktables"."id" IN (SELECT "votes"."tableID" FROM "votes" WHERE "votes"."userID" = ?)  [["userID", 1]]