app/controllers/ranktables_controller.rb

  def index
    @ranktables = Ranktable.all
---
SELECT "ranktables".* FROM "ranktables"

  def show
    @ranktable = Ranktable.find(params[:id])
---
SELECT  "ranktables".* FROM "ranktables" WHERE "ranktables"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @ranktable = Ranktable.new(ranktable_params)
    @ranktable.save
---
INSERT INTO "ranktables" ("title", "description", "author", "count", "options", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)