app/controllers/results_controller.rb

  def index
    @ranktable = Ranktable.find(params[:ranktable_id])
    @votes = []
    numOptions = @ranktable.options.split(/,/).count
    numVotes = Vote.where(tableID: params[:ranktable_id]).count / numOptions
    total = ((numOptions * (1 + numOptions)) / 2) * numVotes
    @ranktable.options.split(/,/).each do |text|
      option = text.tr('[]', '').tr('"','')
      raw = Vote.where(option: option).sum( :rank )
---
SELECT  "ranktables".* FROM "ranktables" WHERE "ranktables"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT COUNT(*) FROM "options" WHERE "options"."ranktable_id" = ?  [["ranktable_id", 22]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."tableID" = ?  [["tableID", 6]]
SELECT "options".* FROM "options" WHERE "options"."ranktable_id" = ?  [["ranktable_id", 22]]
SELECT SUM("votes"."rank") FROM "votes" WHERE "votes"."option" = ?  [["option", "Dunkey"]]