app/controllers/results_controller.rb

SELECT "votes".* FROM "votes" WHERE "votes"."tableID" = ?  [["tableID", 22]]
---
  def index
    @ranktable = Ranktable.find(params[:ranktable_id])
    @votes = Vote.where(tableID: params[:ranktable_id])