app/controllers/results_controller.rb

SELECT SUM("votes"."points") FROM "votes" WHERE "votes"."option" = ?  [["option", "Man of Steel"]]
---
  def index
    @ranktable = Ranktable.find(params[:ranktable_id])
    @votes = []
    @ranktable.options.split(/,/).each do |text|
      option = text.tr('[]', '').tr('"','')
      score = Vote.where(option: option).sum( :points )