app/controllers/votes_controller.rb

  def create
    Vote.where(userID: current_user.id,tableID: params["tableID"]).destroy_all
    @ranktable3 = Ranktable.find(params["tableID"])
    array = params['array'].split(/,/)
    # puts array
    rank = 1
    count = @ranktable3.option.count
    array.each do |value|
      puts value
      points = count - rank
      Vote.create(tableID: params["tableID"], userID: params["user"], option: value, rank: points)
---
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 143]]
SELECT "votes".* FROM "votes" WHERE "votes"."userID" = ? AND "votes"."tableID" = ?  [["userID", 1], ["tableID", 1]]
SELECT  "ranktables".* FROM "ranktables" WHERE "ranktables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "options" WHERE "options"."ranktable_id" = ?  [["ranktable_id", 1]]
INSERT INTO "votes" ("tableID", "userID", "option", "rank", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["tableID", 1], ["userID", 1], ["option", "Infinity War"], ["rank", 7], ["created_at", "2019-06-04 01:46:41.415442"], ["updated_at", "2019-06-04 01:46:41.415442"]]